<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Group Funtions </h1>

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">GROUP_CONCAT <ul>The GROUP_CONCAT function is used in SQL to concatenate values from multiple rows into a single string within each group.<br><br> It is particularly useful when you want to display a list or a summary of values for each group in your result set</ul></div>

In [1]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/mydb

In [3]:
%%sql
SELECT * FROM mobile
LIMIT 1

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[('oneplus', 'OnePlus Nord CE 2 Lite 5G', 19989, 81.0, 1, 0, 0, 'snapdragon', 8.0, 2.2, 5000.0, 1, 33.0, 6.0, 128.0, 6.59, 120, 3, 1.0, 'android', 64.0, 16.0, 1, 1024.0, 1080, 2412)]

In [7]:
%%sql
SELECT brand_name,model,rating,price FROM mobile
GROUP BY brand_name
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('cola', 'Cola Phone', 74.0, 14999),
 ('doogee', 'Doogee V Max', 88.0, 45999),
 ('honor', 'Honor X8 5G', 75.0, 14990),
 ('huawei', 'Huawei Mate 50 RS Porsche Design', 81.0, 239999),
 ('infinix', 'Infinix Note 12 Pro 5G', 84.0, 18999),
 ('iqoo', 'iQOO Z6 Lite 5G', 75.0, 13989),
 ('itel', 'itel Vision 3', 61.0, 6699),
 ('jio', 'Jio JioPhone 5G', 64.0, 11990),
 ('lava', 'Lava Agni 5G', 84.0, 17990),
 ('motorola', 'Motorola Edge 20 Fusion 5G', 87.0, 18999)]

In [12]:
%%sql
SELECT brand_name, GROUP_CONCAT(brand_name) FROM mobile
GROUP BY brand_name
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('cola', 'cola'),
 ('doogee', 'doogee,doogee'),
 ('honor', 'honor'),
 ('huawei', 'huawei,huawei'),
 ('infinix', 'infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix,infinix'),
 ('iqoo', 'iqoo,iqoo,iqoo,iqoo,iqoo,iqoo,iqoo,iqoo,iqoo'),
 ('itel', 'itel'),
 ('jio', 'jio'),
 ('lava', 'lava'),
 ('motorola', 'motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola,motorola')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Suppose you want to create a summary that lists the models for each brand.</div>

In [29]:
%%sql
SELECT brand_name, GROUP_CONCAT(model) FROM mobile
GROUP BY brand_name
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('cola', 'Cola Phone'),
 ('doogee', 'Doogee V Max,Doogee S99'),
 ('honor', 'Honor X8 5G'),
 ('huawei', 'Huawei Mate 50 RS Porsche Design,Huawei Nova 7i'),
 ('infinix', 'Infinix Note 12 Pro 5G,Infinix Zero 5G 2023,Infinix Hot 20,Infinix Zero 20,Infinix Note 12 5G,Infinix Note 12i (2022),Infinix Note 12 Pro,Infinix Hot ... (147 characters truncated) ... Infinix Hot 12 Pro,Infinix Note 13 Pro,Infinix Note 11S (8GB RAM + 128GB),Infinix Note 12 (6GB RAM + 128GB),Infinix Note 12 VIP,Infinix Note 12 Turbo'),
 ('iqoo', 'iQOO Z6 Lite 5G,iQOO Z6 5G,iQOO Z6 Lite (6GB RAM + 128GB),iQOO Z6 5G (6GB RAM + 128GB),iQOO Z6 5G (8GB RAM + 128GB),iQOO Z6 4G (6GB RAM + 128GB),iQOO Z6 4G,iQOO Z7 Pro 5G,iQOO Z8 5G'),
 ('itel', 'itel Vision 3'),
 ('jio', 'Jio JioPhone 5G'),
 ('lava', 'Lava Agni 5G'),
 ('motorola', 'Motorola Edge 20 Fusion 5G,Motorola Moto G82 5G,Motorola Moto G32,Motorola Moto G42,Motorola Moto G82 (8GB RAM + 128GB),Motorola Moto G31,Motorola Mo ... (107 characters truncated) ... oto E13,Motorola Moto G31 (6GB RAM+ 128GB),Motorola Moto E32s,Motorola One Fusion Plus,Motorola Moto G 5G,Motorola One Macro,Motorola Moto G40 Fusion')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Check Price</div>

In [38]:
%%sql
SELECT brand_name, GROUP_CONCAT(price) FROM mobile
GROUP BY brand_name
ORDER BY price ASC
LIMIT 10

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('itel', '6699'),
 ('tecno', '6999,11999,9999,15499,13799,17999,15999,14746,15499,10999'),
 ('nokia', '10499,9499,17990,13499,11999,41990'),
 ('jio', '11990'),
 ('iqoo', '13989,15499,15499,16940,18498,15999,14489,24999,14999'),
 ('honor', '14990'),
 ('cola', '14999'),
 ('poco', '14999,14999,16499,12999,11999,17999,11499,13499,15999,12999,13499,15999,10799,13999,14799,19990,10890,11499,7299,12799,14499,14990'),
 ('samsung', '16499,16999,23790,17478,18999,18499,15999,20999,13999,22999,31999,25289,19499,25999,8499,10999,14999,34999,8499,36499,16499,19990,12999,24999,33499,1 ... (92 characters truncated) ... ,14490,15490,10630,41999,24499,24990,17990,39990,39999,14499,17999,11725,15990,58999,74999,11499,8499,83000,17990,78990,10999,22999,18499,10499,19999'),
 ('vivo', '16990,14499,27999,18499,16499,19990,13489,15990,15999,31999,14499,19990,24999,14990,23999,15490,24990,17990,23269,13990,17999,16685,13999,14990,29999,31990,27990,9990,15990,12499,15499,20000,11990,22990')]

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">WITH ROLLUP <ul>It generates subtotals and a grand total for a specific hierarchy of columns.<br><br>It includes subtotals for each level in the hierarchy, moving from left to right in the list of columns specified in the GROUP BY clause.<br><br> Rows with NULL values in the grouping columns represent subtotals, and a row with all NULL values represents the grand total.</ul></div>

In [56]:
%%sql

SELECT brand_name AS model, SUM(rating) total_rating
FROM mobile
GROUP BY brand_name, model 
LIMIT 10
# without rollup

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('cola', 74.0),
 ('doogee', 84.0),
 ('doogee', 88.0),
 ('honor', 75.0),
 ('huawei', 81.0),
 ('huawei', 81.0),
 ('infinix', 72.0),
 ('infinix', 66.0),
 ('infinix', 74.0),
 ('infinix', 76.0)]

In [57]:
%%sql

SELECT brand_name AS model, SUM(rating) total_rating
FROM mobile
GROUP BY brand_name, model WITH ROLLUP
LIMIT 10
# rollup

 * mysql+pymysql://root:***@localhost:3307/mydb
10 rows affected.

[('cola', 74.0),
 ('cola', 74.0),
 ('doogee', 84.0),
 ('doogee', 88.0),
 ('doogee', 172.0),
 ('honor', 75.0),
 ('honor', 75.0),
 ('huawei', 81.0),
 ('huawei', 81.0),
 ('huawei', 162.0)]

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">GROUPING SETS <ul>GROUPING SETS is a clause in SQL that is used in conjunction with the GROUP BY statement, allowing the specification of multiple grouping sets in a single query. <br><br>It is utilized to create subtotals and grand totals for different combinations of columns in the result set.</ul></div>

<br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">unfortunately GROUPING SETS not working in mysql So Use UNION</div>

<br><br><br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Subtotal for Each Brand_name and Model.</div>

In [72]:
%%sql

SELECT 
    brand_name,
    model,
    COUNT(*) AS total_records
FROM 
    mobile
GROUP BY brand_name, model
LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('cola', 'Cola Phone', 1),
 ('doogee', 'Doogee S99', 1),
 ('doogee', 'Doogee V Max', 1),
 ('honor', 'Honor X8 5G', 1),
 ('huawei', 'Huawei Mate 50 RS Porsche Design', 1)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Subtotal for Each Brand_name</div>

In [75]:
%%sql

SELECT 
    brand_name,
    NULL AS model,
    COUNT(*) AS total_records
FROM 
    mobile
GROUP BY 
    brand_name

LIMIT 5

 * mysql+pymysql://root:***@localhost:3307/mydb
5 rows affected.

[('cola', None, 1),
 ('doogee', None, 2),
 ('honor', None, 1),
 ('huawei', None, 2),
 ('infinix', None, 20)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Grand Total
</div>

In [76]:
%%sql

SELECT 
    NULL AS brand_name,
    NULL AS model,
    COUNT(*) AS total_records
FROM 
    mobile;

 * mysql+pymysql://root:***@localhost:3307/mydb
1 rows affected.

[(None, None, 352)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now Use UNION
</div>

In [79]:
%%sql

-- Combine Subtotals using UNION ALL
SELECT 
    brand_name,
    model,
    COUNT(*) AS total_records
FROM 
    mobile
GROUP BY 
    brand_name, model

UNION ALL

SELECT 
    brand_name,
    NULL AS model,
    COUNT(*) AS total_records
FROM 
    mobile
GROUP BY 
    brand_name

UNION ALL

SELECT 
    NULL AS brand_name,
    NULL AS model,
    COUNT(*) AS total_records
FROM 
    mobile

LIMIT 20

 * mysql+pymysql://root:***@localhost:3307/mydb
20 rows affected.

[('cola', 'Cola Phone', 1),
 ('doogee', 'Doogee S99', 1),
 ('doogee', 'Doogee V Max', 1),
 ('honor', 'Honor X8 5G', 1),
 ('huawei', 'Huawei Mate 50 RS Porsche Design', 1),
 ('huawei', 'Huawei Nova 7i', 1),
 ('infinix', 'Infinix Hot 12', 1),
 ('infinix', 'Infinix Hot 12 Play', 1),
 ('infinix', 'Infinix Hot 12 Pro', 1),
 ('infinix', 'Infinix Hot 12 Pro (8GB RAM+ 128GB)', 1),
 ('infinix', 'Infinix Hot 20', 1),
 ('infinix', 'Infinix Hot 20 (6GB RAM+ 128GB)', 1),
 ('infinix', 'Infinix Hot 20 Play', 1),
 ('infinix', 'Infinix Note 11S (8GB RAM + 128GB)', 1),
 ('infinix', 'Infinix Note 12', 1),
 ('infinix', 'Infinix Note 12 (6GB RAM + 128GB)', 1),
 ('infinix', 'Infinix Note 12 5G', 1),
 ('infinix', 'Infinix Note 12 Pro', 1),
 ('infinix', 'Infinix Note 12 Pro 5G', 1),
 ('infinix', 'Infinix Note 12 Turbo', 1)]